package org.oksanka;

public enum ButtonResponseEnum {

    BUTTON_A1_MESSAGE("A1", """
            
            Якщо ви переживаєте стрес, знайте, що ви такі не одні.
            Зараз у вашій громаді та й в усьому світі багато інших людей також страждають від стресу.
            
            "Стрес" - це відчуття перенапруження через життєві проблеми та загрози. Стрес може бути спричиненим серйозними загрозамию.
            Наприклад, сімейним насильством, згвалтуванням,хворобою, неможливістю навчатися, труднощами забезпечення сімʼї, жорстокістю в громаді, вимушеністю покинути свій дім... чи меншими проблемами: родинними сварками, тривоги щодо майбутнього.
            
            Час від часу кожен переживає стрес.
            
            Ми допоможемо вам навчитися практичним навичкам для того, щоб краще справлятися зі стресом.
            
            Щоб дізнатися більше про прояви сресу натисни, будь ласка, /manifestations
            Щоб повернутися до menu натисни, будь ласка, /begin
                                                                                                          
            """),
    BUTTON_A2_MESSAGE("A2", "Привіт! Натисни, будь ласка, /start, щоб розпочати спілкування."),
    BUTTON_A3_MESSAGE("A3", "Привіт! Натисни, будь ласка, /start, щоб розпочати спілкування."),
    BUTTON_A4_MESSAGE("A4", "Привіт! Натисни, будь ласка, /start, щоб розпочати спілкування."),
    BUTTON_A5_MESSAGE("A5", "Привіт! Натисни, будь ласка, /start, щоб розпочати спілкування."),
    BUTTON_A6_MESSAGE("A6", "Привіт! Натисни, будь ласка, /start, щоб розпочати спілкування.");

    private final String key;
    private final String message;

    ButtonResponseEnum(String key, String message) {
        this.key = key;
        this.message = message;
    }

    public String getKey() {
        return key;
    }

    public String getMessage() {
        return message;
    }

}
