package org.oksanka;

public enum ButtonResponseEnum {

    BUTTON_A1_MESSAGE("A1", """
            
            Якщо ви переживаєте стрес, знайте, що ви такі не одні.
            Зараз у вашій громаді та й в усьому світі багато інших людей також страждають від стресу.
            
            "Стрес" - це відчуття перенапруження через життєві проблеми та загрози. Стрес може бути спричиненим серйозними загрозамию.
            Наприклад, сімейним насильством, згвалтуванням,хворобою, неможливістю навчатися, труднощами забезпечення сімʼї, жорстокістю в громаді, вимушеністю покинути свій дім... чи меншими проблемами: родинними сварками, тривоги щодо майбутнього.
            
            Час від часу кожен переживає стрес.
            
            Ми допоможемо вам навчитися практичним навичкам для того, щоб краще справлятися зі стресом.
            
            Щоб дізнатися більше про прояви сресу натисни, будь ласка, /manifestations
            Щоб повернутися до menu натисни, будь ласка, /begin
                                                                                                          
            """),

    BUTTON_A2_MESSAGE("A2", """ 
            Що для тебе є робота?
            
            Чи стикався ти із таким явищем, як трудоголізм? (синдром Капоші)
            Що це означає?
            - продовження вдасної ініціативи робочого тижня до 40 годин;
            - виконання частини роботи в ліжку, при захворюванні, у вихідні дні та у відпусці;
            - постійні розмови з рідними та знайомими про роботу;
            - впевненість, що тривало працювати - прояв поваги та любові до професії та відданість організації;
            - роздуми про роботу за кермом автомобіля або під час сну.
            
            Часто такі речі призводять до синдрому емоційного вигорання (Burn Out Syndrome).
            
            Щоб дізнатися більше про прояви синдрому емоційного вигорання натисни, будь ласка, /syndrome
            
            Щоб повернутися до menu натисни, будь ласка, /begin  
           
            """
            ),
    BUTTON_A3_MESSAGE("A3", """
            Тривожність — індивідуальна властивість особи, риса характеру, що проявляється схильністю до надмірного хвилювання, стану тривоги в ситуаціях, які загрожують, на думку цієї особи, неприємностями, невдачами, фрустрацією.
            Важливо, що мова йде про психологічну загрозу, тобто таку, що має суб'єктивний характер і не проявляється як фізична небезпека. Такими ситуаціями можуть бути: деякі конфлікти, порівняння людиною себе з тими, хто має певну перевагу, змагання з такими людьми.
            Як страх, так і тривога є адекватними реакціями на небезпеку, але в разі страху небезпека очевидна, об'єктивна, а в разі тривоги вона прихована і суб'єктивна. Інакше кажучи, інтенсивність тривоги пропорційна тому змісту, який для даної людини має дана ситуація. Причини ж її тривоги, по суті, їй невідомі.\s
            
            А от тривожний розлад — це вже психічний розлад, це про надмірну тривогу. Коли ви не знаєте, що трапиться, але знаходитесь у напруженні. І цей стан не завершується! Якщо він не завершується і ми говоримо про надмірну тривогу, пильність, то вона нас виснажує. Вона порушить сон, вона викличе якісь фізичні дисфункції, 
            порушить харчування тощо. Ми стаємо безпорадні для себе та для оточуючих.
            
            Щоб дізнатися більше про прояви тривожного розладу натисни, будь ласка, /anxiety
            
            Щоб повернутися до menu натисни, будь ласка, /begin  
                        
            """),

    BUTTON_A4_MESSAGE("A4", "Привіт! Натисни, будь ласка, /start, щоб розпочати спілкування."),
    BUTTON_A5_MESSAGE("A5", "Привіт! Натисни, будь ласка, /start, щоб розпочати спілкування."),
    BUTTON_A6_MESSAGE("A6", "Привіт! Натисни, будь ласка, /start, щоб розпочати спілкування.");

    private final String key;
    private final String message;

    ButtonResponseEnum(String key, String message) {
        this.key = key;
        this.message = message;
    }

    public String getKey() {
        return key;
    }

    public String getMessage() {
        return message;
    }

}
