package org.oksanka;

public enum MessageResponseEnum {
    WELCOME_MESSAGE("/start", """
            Привіт! Я твій власний mental_health_helper_bot!
            І ти можеш до мене звертатися, коли потрібна допомога 
            у будь - який час. Якшо ти віддчуваєш занепокоєння, тривогу, 
            незрозумілі відчуття в своєму душевному стані чи піддався/піддалася стресовій ситуації, 
            то звертайся. Я знайду найкращий спосіб тобі допомогти і заспокоїти!
                 
            Спробуємо дізнатися, що тебе турбує. Щоб розпочати натисни /begin"""),
    BEGIN_MESSAGE("/begin",
            "Про що ти хочеш дізнатися більше? Вибери, будь ласка, із переліченого:"),

    MANIFESTATION_MESSAGE("/manifestations",
            """
                    Незначний стрес не є проблемою. Але дуже високий рівень стресу часто впливає і на тіло.
                    У багатьох людей виникають неприємні відчуття: 
                    головний біль, відсутність апетиту, біль у шиї та плечах, комок в горлі, біль в спині, важкість в грудях, розлади шлунку, напружені мʼязи, висипання на шкірі, інфекції хвороби
                    чи проблеми з кишечником.
                                        
                    Такі сильні почуття та думки властиві будь-якому стресу. 
                                        
                    Але якщо ми "зачепимося" за їх гачок, то можуть виникнути проблеми. Отже, ці важкі думки та почуття "чіпляють" нас на гачок і відтягують геть від наших ЦІННОСТЕЙ.
                    Цінності - це ваші найглибші бажання стосовно того, якою людиною ви хочете бути.
                                        
                    Існує багато різних важких думок і почуттів, які можуть нас зачепити: 
                    - думки про те, щоб махнути на все рукою (я здаюся! Все занадто важко!); 
                    - думки про те, щоб звинуватити інших (Він не повинен був цього робити. Це його провина!);
                    - різкі судження про себе (Я слабка людина. Мабуть, я ненормальна людина!); 
                    - спогади, особливо про важкі події; 
                    - думки про майбутнє, особливо про наші страхи щодо нього;
                    - тривожні думки про інших.
                                        
                    Або ми можемо замикатися в собі й відсторонюватися від тих, кого любимо. Або проводити багато часу лежачи у ліжку. Ми можемо вплутуватися в бійки, сваритися чи вступати в суперечки.
                                        
                    Щоб розібратися, як можна навчитися справлятися з цими симптомами, натисни, будь ласка, /practice
                    Щоб повернутися до menu натисни, будь ласка, /begin
                    """),
    PRACTICE_MESSAGE("/practice", """
            Що означає "бути включеними в життя? - 
            "Бути включеним" у щось - це означає приділяти цьому всю свою увагу.
                        
            Коли ви п'єте якийсь напій, чи приділяєте ви йому всю свою увагу?
            Чи насолоджуєтеся ви його запахом і смаком?                                                                                    
            Коли ви слухаєте музику, чи приділяєте ви їй всю свою увагу? 
            Чи слухаєте ви їі, отримуючи від неї задоволення?
                        
            Коли ви приділяєте всю свою увагу будь-якій діяльності, ми говоримо, що ви "включені" в цю діяльність. Але коли ви на гачку своїх думок і почуттів, ви - "не включені", "відсторонені".Коли ви приділяєте всю свою
            увагу будь-якій діяльності, ми говоримо, що ви "зосереджені. 
                        
            Є багато способів розвитку навичок включення у життя чи зосередження. 
                        
            Наприклад, коли ви п'єте чай або каву... зосередьте на цьому всю свою увагу. Ви з цікавістю розглядаєте напій, наче ніколи раніше його не бачили. Отримайте насолоду від його аромату. Зверніть увагу на колір. ПОВІЛЬНО зробіть перший ковток. Затримайте
            його на язиці, відчуйте як він торкається зубів і насолоджуйтеся його смаком. Ви просто приділяєте цій діяльності всю свою увагу.
                        
            Але інколи почуття та історії такі болючі. Так, іноді вони настільки сильні, що  перетворюються в "емоційні бурі".
                        
            Щоб розібратися, як можна навчитися справлятися з цими симптомами, натисни, будь ласка, /continue_practice
            Щоб повернутися до menu натисни, будь ласка, /begin
            """),

    CONTINUE_PRACTICE_MESSAGE("/continue_practice", """
                     "Емоційна буря" означає, що вас заполонили неймовірно важкі думки та почуття. Вони настільки потужні, що схожі на сильну бурю і можуть з легкістю подолати вас. 
                     
            Спершу ЗВЕРНІТЬ УВАГУ на те, як ви себе почуваєте і що ви думаєте.
            Потім УПОВІЛЬНІТЬСЯ і З'ЄДНАЙТЕСЯ зі своїм тілом. Сповільніть дихання. Повністю видихніть повітря з легень. Тоді якомога повільніше наповніть їх повітрям знову. Повільно притисніть свої ступні до підлоги.Повільно витягніть руки 
            вздовж тіла або так само повільно зімкніть долоні перед собою.Наступним кроком  у заземленні є ПЕРЕНАПРАВЛЕННЯ УВАГИ на світ навколо вас. Зверніть увагу на те, де ви знаходитесь. Які п'ять  предметів ви бачите?                                                        
            Які три-чотири звуки ви чуєте?  Вдихніть повітря. Який запах ви відчуваєте? Зверніть увагу на те, де ви знаходитеся і що ви робите. Доторкніться до коліна чи до поверхні на якій ви сидите, чи до будь-якого предмета, до якого можете дотягтися. Зверніть увагу на те, що ви відчуваєте під своїми пальцями.
                
            Так само звертайте увагу на те, як з'являються важкі думки та почуття. А, також, на світ навколо вас, світ, який ви можете бачити,чути,торкатися, смакувати і нюхати.
            Ви також можете рухати своїми руками, ногами і ротом, і, відповідно, при бажанні, ви можете діяти згідно з власними цінностями.
            Це не прожене ваші емоційні бурі. Воно лише збереже вас у безпеці, поки буря не вщухне.
            Деякі бурі тривають довго. Інші минають швидко.
                    
            Щоб розібратися, для чого ці практики, натисни, будь ласка, /goal_practice
                
            Щоб повернутися до menu натисни, будь ласка, /begin        
                    
            """),
    GOAL_PRACTICE_MESSAGE("/goal_practice", """
            Мета вправ  - допомогти вам "включитися" у життя. Наприклад, допомогти вам приділяти всю свою увагу родині та друзям.
            Вони також призначені допомогти вам рухатися назустріч вашим цінностям і поводитися так, як людина, якою ви б хотіли бути.
                        
            І допомогти вам зосередитися на тому, що ви робите, щоб ви могли робити це добре. Коли ви навчитеся концентруватися і повністю включатися в будь-яке заняття, ви також зможете отримувати від нього
            більше задоволення. Це працює навіть тоді, коли вам необхідно виконувати якісь монотонні дії, або роботу, яка дратує.
            Коли ми включаємось у життя, приділяємо увагу іншим, зосереджуємося на тому, що робимо, і живемо згідно з власними цінностями, ми набагато краще справляємося зі
            стресом.Це наче нарощування м'язів для того, щоб швидше бігати чи піднімати більшу вагу. Чим більше ви тренуєтесь, тим сильнішими стають ваші м'язи!
                        
            Пам'ятайте, навіть найменші дії мають значення.  Коли ви дієте згідно зі своїми цінностями, ви стаєте творцем власного насиченого життя, що приносить більше задоволення.                                                                               \s
                        
            Щоб дізнатися більще про боротьбу зі стресом та опанувати більше практик, перейдіть за посиданням:          
            World Health Organization Regional office for Europe                                           
            https://apps.who.int/iris/bitstream/handle/10665/339150/WHO-EURO-2021-361-40096-56774-ukr.pdf
                        
            Також, рекомендую за необхідністю звернутися до фахівця.
                        
            Щоб повернутися до menu натисни, будь ласка, /begin  
                
            """),
    BURN_OUT_MESSAGE("/syndrome", """
            Головні симптоми Burn Out Syndrome:
            - емоційне спустошення, мотиваційне виснажання;
            - розумове виснажання;
            - фізична втома;
            - особистісне відсторонення;
            - "автоматичне" виконання роботи;
            - байдужість та цинізм;
            - недооцінка власлих професійних досягнень;
            - ослабдкння відчуття задоволення від роботи;
            - порушення взаємостосунків з колегами та в сім’ї ;
            - погіршення якості життя та негативне ставлення до себе; 
            - розлади фізичного та психічного здоров’я.
                        
            Якщо хочеш відповісти на більше запитань, які можуть допомогти у визначенні вигорання, 
            натисни, будь ласка, /burn_out_questions
                        
            Щоб повернутися до menu натисни, будь ласка, /begin  
                        
            """),
    BURN_OUT_SYNDROME_MESSAGE("/burn_out_questions", """
            Ось кілька питань, які можуть допомогти у визначенні вигорання:
                        
            - Важко зосередитися?
            - Чи з’явилося безсоння?
            - Результати не задовольняють?
            - Чи з’явилося цинічне відношення?
            - Треба себе змушувати щось робити?
            - Постійно енергія на нулі, відчуття непродуктивності?
            - Втішаєшся їжею, алкоголем, наркотиками?
            - Тебе дратують клієнти, колеги, люди поруч?
            - Болить голова, нудить, з’явилися нові проблеми зі здоров’ям?
            - Порушилася харчова поведінка, тобто або переїдання або втрата апетиту?
                        
                        
            Щоб дізнатися більше натисни, будь ласка, /about
                        
            Щоб повернутися до menu натисни, будь ласка, /begin  
                        
            """),
    ABOUT_BURN_OUT_SYNDROME_MESSAGE("/about", """
            Особливо схильними до вигорання на роботі є люди, які працюють в сфері «людина- людина», тобто ті, чия робота пов’язана з постійниим спілкуванням. Це лікарі, педагоги, психологи, соціальні працівники, волонтери, менеджери, керівники різних сфер та інші. Необхідність постійно бути на зв’язку, вислуховувати інших і говорити самому, стежити за важливими новинами, давати вказівки підлеглим або навпаки виконувати доручення керівництва, намагатися виправдати чиїсь очікування, перевершити конкурентів, продемонструвати хороші показники — все це призводить до того, що в якийсь момент у людини просто «сідають батарейки».
            Чим емоцйійне вигорання відрізняється від перевтоми?
                                
            Коли ти просто втомився/втомилася, то можеш привести себе в норму за кілька днів. Досить просто виспатися, провести вихідні з вимкненим телефоном, щоб відпочити від постійних дзвінків, переключитися на хорошу книгу, сходити в спортзал або прийняти гарячу ванну, і ось, ви знову сповнені сил і енергії.
                                
            Якщо у тебе емоційне вигорання, його не позбутися просто так. Більш того, з часом все тільки погіршується. Нервове напруження і стреси призводять до погіршення сну, підвищена дратівливість провокує конфліктні ситуації на роботі, негаразди в професійній сфері відбиваються на сім’ї та особистих стосунках.
                        
            Щоб дізнатися як уникнути емоційного вигорання, натисни, будь ласка, /prevention
                    
            Щоб повернутися до menu натисни, будь ласка, /begin              
                    """),

    PREVENTION_BURN_OUT_SYNDROME_MESSAGE("/prevention", """
            Як уникнути вигорання?
                    
            - Намагатися розраховувати і обдумано розподіляти свої навантаження
            - Вчитися переключатися з одного виду діяльності на інший
            - Простіше ставитися до конфліктів на роботі
            - Не намагатися завжди і в усьому бути кращим/кращою  
            - Знайти місце зупинки роботи (ефект «тумблера»)
            - Працювати над подоланням стереотипів в роботі
            - Пам'ятати про різні види психотерапії та використовувати їх
            - Використовувати різні види психотерапії
            - Зайнятися іншою (паралельною) діяльністю
            - Балінтовські групи
            - Неформальні відносини на роботі
            - Турбуватися про когось за межами роботи
            - Ніколи не страждати поодинці - поговорити з тим, кому довіряєте
            - Прийняти теплий душ, розслабитися і дати волю сльозам
            - Ретельно проаналізувати ситуацію    
            - Думати про майбутнє і обов'язково планувати до деталей
            - Тренуватися «Думати про їжу, коли їсте, і про чашку, коли її миєте»
            - Робота - щоденний елізод життя, В чому суть життя для Вас?
            - Розуміти, що твоя робота має позитивні і негативні сторони
            - Аналізувати чого ти досягнув/досягнула і якими зусиллями
            - Вести щоденник, фіксувати найбільші враження та свою допомогу комусь!
                        
            Щоб дізнатися як подолати емоційного вигорання, натисни, будь ласка, /overcoming
                    
            Щоб повернутися до menu натисни, будь ласка, /begin       
                        
                    """),

    OVERCOMING_BURN_OUT_SYNDROME_MESSAGE("/overcoming", """
            Як подолати емоційного вигорання?   
              
            - Товаришуй, спілкуйтеся із тими, хто радіє життю
            - Проводьдь з батьками більше часу - момент, коли їх не стане, завжди настає неочікувано
            - Ввічливість завойовує міста. Користуйся цим частіше
            - Не дивися телевізор. Ніколи
            - Відмовся від звички постійно скаржитися. Нікого не цікавлять чужі проблеми
            - У незрозумілих ситуаціях завжди лягай спати. Також в будь-яких ситуаціях пам'ятай, що «і це пройде»
            - Навіть в серйозній сварці не намагайся зачепити людину за живе. Ви помиритеся (скоріш за все), а слова запам'ятаються надовго
            - Не повертайся до людей, які тебе зрадили. Вони не міняються
            - Не смійтеся над чужими мріями
            - Є такий вираз: «Рухатися далі». Спробуй, допомагає
            - На початку дня роби всі самі важкі та неприємні справи
            - Частіше гладь собаку чи кота. Перевірено - допомагає
            - Пам'ятай: ніхто нікому нічого не винен. Забудь слово «винен», «повинен»
            
            Ти можеш переглянути відео чудового фахівця за посиланням https://youtu.be/EORBcoDf4Vo
            
            Також, рекомендую за необхідністю звернутися до фахівця.
                        
            Щоб повернутися до menu натисни, будь ласка, /begin  
                
            """),

    ANXIETY_MESSAGE("/anxiety", """
            Фізіологічні ознаки тривожного розладу
                        
            - Головний біль
            - Біль у грудях
            - "Нервова" діярея
            - Підвищений тиск
            - Прискорене серцебиття
            - Відчуття нестачі повітря
            - Підвищене потовиділення
            - Тремор
            - Тонус м'язів
                        
            Психологічні симптоми тривожного розладу
                        
            - Втомлюваність
            = Підвищена лякливість
            - Порушення сну
            - Підвищена залученість до хобі
            - Втрата інтересу до життя
            - Почуття самотності
            - Забудькуватість
            - Почуття злості
                        
            Щоб дізнатися більше, натисни, будь ласка, /testing
                    
            Щоб повернутися до menu натисни, будь ласка, /begin               
                
            """),
    TESTING_ANXIETY_MESSAGE("/testing", """
    Пропоную, щоб визначити рівень твоєї тривожності проди тестування за посиланням 
    https://www.samopomi.ch/get-tested/test-dlja-skriningu-trivozhnosti-gad-7
    
    Щоб дізнатися як подолати тривогу, натисни, будь ласка, /coping
                    
    Щоб повернутися до menu натисни, будь ласка, /begin  
    """),

    DEFAULT_MESSAGE(null, "Привіт! Натисни, будь ласка, /start, щоб розпочати спілкування.");
    private final String key;
    private final String message;

    MessageResponseEnum(String key, String message) {
        this.key = key;
        this.message = message;
    }

    public String getKey() {
        return key;
    }

    public String getMessage() {
        return message;
    }

}
